; domain
(define (domain vincentland)
	(:predicates
		(location ?l)
		(item ?i)
		(character ?c)
		(has ?cl ?i)
		(at ?c ?l)
		(player ?p)
        (cooperative ?c)
        (wants ?c ?i)
        (dead ?c)
        (weapon ?w)
        (adjacent ?la ?lb))

	(:action move
		:parameters  (?p ?to ?from)
		:precondition (and (location ?to) (location ?from) (player ?p) (at ?p ?from))
		:effect (and (at ?p ?to) (not (at ?p ?from))))

	(:action getfromlocation
   		:parameters (?p ?i ?loc)
   		:precondition (and (item ?i) (player ?p) (location ?loc) (has ?loc ?i) (at ?p ?loc))
   		:effect (has ?p ?i))

   	(:action given
   		:parameters (?charA ?p ?i ?loc)
   		:precondition (and (character ?charA) (player ?p) (item ?i) (has ?charA ?i) (location ?loc) (at ?charA ?loc) (at ?p ?loc) (cooperative ?charA))
   		:effect (and (has ?p ?i) (not (has ?charA ?i))))

   	(:action giveto
   		:parameters (?p ?charB ?i ?loc)
   		:precondition (and (character ?charB) (player ?p) (item ?i) (has ?p ?i) (location ?loc) (at ?charB ?loc) (at ?p ?loc))
   		:effect (and (has ?charB ?i) (not (has ?p ?i)) (cooperative ?charB)))

    (:action kill
        :parameters (?p ?charA ?i ?loc ?w)
        :precondition (and (player ?p) (character ?charA) (at ?charA ?loc) (at ?p ?loc) (item ?i) (location ?loc) (has ?charA ?i) (weapon ?w) (has ?p ?w))
        :effect (and (not (character ?charA)) (has ?loc ?i) (dead ?charA) (item ?charA)))

    (:action escort
        :parameters (?p ?charA ?locA ?locB)
        :precondition (and (player ?p) (character ?charA) (location ?locA) (location ?locB) (at ?p ?locA) (at ?charA ?locA))
        :effect (and (at ?p ?locB) (at ?charA ?locB) (not (at ?p ?locA)) (not (at ?charA ?locA))))

    (:action drop
        :parameters (?p ?loc ?i)
        :precondition (and (player ?p) (location ?loc) (item ?i) (has ?p ?i) (at ?p ?loc))
        :effect (and (not (has ?p ?i)) (has ?loc ?i)))
)

; problem
(define (problem baker)
(:domain vincentland)
(:objects ore wheat field troll mine baker hammer bakery forge you blacksmith )
(:init (item wheat)
(item hammer)
(at blacksmith forge)
(at troll mine)
(at you bakery)
(cooperative blacksmith)(player you)
(at baker bakery)
(item ore)
(has mine ore)
(character troll)
(weapon hammer)
(character blacksmith)
(location bakery)
(has field wheat)
(location mine)
(character baker)
(has troll hammer)
(location field)
(has blacksmith ore)
(location forge)
)
(:goal (and (dead baker) (cooperative troll) (cooperative blacksmith))))

; plan
1. (escort you baker bakery mine)
   deleted: (at you bakery) (at baker bakery)
   added: (at you mine) (at baker mine)
   goals met: 1 of 3
2. (getfromlocation you ore mine)
   added: (has you ore)
   goals met: 1 of 3
3. (giveto you baker ore mine)
   deleted: (has you ore)
   added: (has baker ore) (cooperative baker)
   goals met: 1 of 3
4. (getfromlocation you ore mine)
   added: (has you ore)
   goals met: 1 of 3
5. (giveto you troll ore mine)
   deleted: (has you ore)
   added: (has troll ore) (cooperative troll)
   goals met: 2 of 3
6. (given troll you hammer mine)
   deleted: (has troll hammer)
   added: (has you hammer)
   goals met: 2 of 3
7. (kill you baker ore mine hammer)
   deleted: (character baker)
   added: (dead baker) (item baker)
   goals met: 3 of 3
